# DATA542 Quiz (20 points)
This quiz has 20% of your total score in this course. 

**Exam Format and Submission:**

You will be asked to answer the following questions within this Jupyter notebook. 

Instructions: 

1. Answer within the same notebook and provide answers in the cell below each question. Do NOT create a separate cell that includes all your answers. It will waste your time!

2. Enter your name within the notebook at first.

3. For your convenience, the results are shown below each question. So you know what you are asked for in each quesiton.

4. You need to upload your notebook to *Canvas*. 

5. The submission link on Canvas will be closed at 10:50 AM. Make sure to submit ontime, or you will lose all marks for the exam. 

6. Answering the academic Honesty question is MANDATORY. This question has no marks. But leaving it empty means a report to the program coordinators and probably dean's office and could have consequences.


**IMPORTANT NOTE: The exam is closed book. You are not allowed to use lecture notes, internet, or get help of any kind. You are allowed to use the help function or look into the documentations WITHIN the ipython notebook only.** 

**Exam Time:**

You have 75 minutes to answer the questions. Five extra minutes is considered for the submission. If you do not submit on time, your exam is considered as NOT submitted and receive no points. 
 
 
**Violations to the use of internet, specially communicating with others during the exam will lead to immediate _FAILURE_ in the course. The incident will be reported to the program coordinator and has its own consequences, even one might have to leave the program.**

### Student Name 

**Add your last name to the file name when you upload this notebook.**

### Question 0.0 (0 points)

Academic honesty is an expectation of all members of UBCs community, from first-year undergraduates to professors. All UBC students are expected to behave as honest and responsible members of an academic community. This includes, but is not limited to, never taking credit for work completed by another individual. All tests, assignments, and other forms of assessment must be completed by the individual being assessed, and only by the individual being assessed.

a) Do you agree to abide by the UBC expectations of academic honesty? [yes/no]

b) Write “I hereby declare that all work within this exam is my own and only my own.” Then print your name, (sign your name if you can), and write the date below the declaration.

 

Failure to answer this question honestly will result in a 0 on the exam and a report to the Dean
Failure to write the note as mentioned above will result in a 0 on the exam and a report to the Dean. 
Answering “no” on this question will result in a report to the Dean.

#answer here   
a) yes    
b) Dhun Sheth   
"Feb 8th, 2024"

### Question 0.1 (0 points)

Enter your name in the following: Dhun Sheth

### Preparing the required steps (0.5 points)

Import the pandas and numoy libraries

Read the sales_data.csv file and name the dataframe as sales. 
If you see errors, use ('file_name.csv', encoding = "ISO-8859-1") 
or ('file_name.csv', encoding='unicode_escape') while reading your file.

In [2]:
import pandas as pd
import numpy as np

In [3]:
sales = pd.read_csv('sales_data.csv', encoding='unicode_escape')
sales.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

### Question 1 (1 points)

Q1. How many records are for each year? The result can be like the following output.

In [4]:
sales['YEAR_ID'].value_counts()

YEAR_ID
2004    1345
2003    1000
2005     478
Name: count, dtype: int64

### Question 2 (1 points)
Q2. What is the sum of SALES for the 'QTR_ID' in each 'YEAR_ID'?

In [53]:
sales.groupby(['YEAR_ID', 'QTR_ID'])['SALES'].sum()

YEAR_ID  QTR_ID
2003     1          445094.69
         2          562365.22
         3          649514.54
         4         1860005.09
2004     1          833730.68
         2          766260.73
         3         1109396.27
         4         2014774.92
2005     1         1071992.36
         2          719494.35
Name: SALES, dtype: float64

### Question 3 (1 points)

Q3. Show how many null values the dataset has for each of the columns?

In [56]:
sales.isnull().sum()

ORDERNUMBER            0
QUANTITYORDERED        0
PRICEEACH              0
ORDERLINENUMBER        0
SALES                  0
ORDERDATE              0
STATUS                 0
QTR_ID                 0
MONTH_ID               0
YEAR_ID                0
PRODUCTLINE            0
MSRP                   0
PRODUCTCODE            0
CUSTOMERNAME           0
PHONE                  0
ADDRESSLINE1           0
ADDRESSLINE2        2521
CITY                   0
STATE               1486
POSTALCODE            76
COUNTRY                0
TERRITORY           1074
CONTACTLASTNAME        0
CONTACTFIRSTNAME       0
DEALSIZE               0
dtype: int64

### Question 4 (1 points)
Q4. Drop the ADDRESSLINE2 and STATE columns. The dropped columns should be applied on the sales dataframe, not its view (not on copy of the dataframe). 

Check again by printing the information of the sales data.

In [97]:
sales.drop(['ADDRESSLINE2','STATE'], axis=1, inplace=True)
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 23 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2823 non-null   int64
 1   QUANTITYORDERED   2823 non-null   int64
 2   PRICEEACH         2823 non-null   float64
 3   ORDERLINENUMBER   2823 non-null   int64
 4   SALES             2823 non-null   float64
 5   ORDERDATE         2823 non-null   object
 6   STATUS            2823 non-null   object
 7   QTR_ID            2823 non-null   int64
 8   MONTH_ID          2823 non-null   int64
 9   YEAR_ID           2823 non-null   int64
 10  PRODUCTLINE       2823 non-null   object
 11  MSRP              2823 non-null   int64
 12  PRODUCTCODE       2823 non-null   object
 13  CUSTOMERNAME      2823 non-null   object
 14  PHONE             2823 non-null   object
 15  ADDRESSLINE1      2823 non-null   object
 16  CITY              2823 non-null   object
 17  POSTALCODE        2747 non-null   object
 18  COUNTRY           2823 non-null   object
 19  TERRITORY         1749 non-null   object
 20  CONTACTLASTNAME   2823 non-null   object
 21  CONTACTFIRSTNAME  2823 non-null   object
 22  DEALSIZE          2823 non-null   object
dtypes: float64(2), int64(7), object(14)
memory usage: 507.4+ KB

### Question 5 (1 points)

Q5. Select the SALES, STATUS, YEAR_ID, COUNTRY, and PRODUCTLINE and assign it to a dataframe called df.

Show the last five rows.

In [99]:
df = sales[['SALES', 'STATUS', 'YEAR_ID','COUNTRY', 'PRODUCTLINE']]
df.tail(5)

        SALES    STATUS  YEAR_ID  COUNTRY PRODUCTLINE
2818  2244.40   Shipped     2004    Spain       Ships
2819  3978.51   Shipped     2005  Finland       Ships
2820  5417.57  Resolved     2005    Spain       Ships
2821  2116.16   Shipped     2005   France       Ships
2822  3079.44   On Hold     2005      USA       Ships

### Question 6 (1 points)

value_count() returns counts of unique values. 

Q6. What is the value_count() of the PRODUCTLINE of sales data?

In [103]:
sales['PRODUCTLINE'].value_counts()

PRODUCTLINE
Classic Cars        967
Vintage Cars        607
Motorcycles         331
Planes              306
Trucks and Buses    301
Ships               234
Trains               77
Name: count, dtype: int64

### Question 7 (1 points)

Q7. Find the sum of the SALES and QUANTITYORDERED based on the STATUS of the records for **Spain**. In the results shown below, the values of the SALES column are summed based on the STATUS, and the same for QUANTITYORDER.

In [107]:
sales[sales['COUNTRY']=='Spain'].groupby('STATUS')[['SALES', 'QUANTITYORDERED']].sum()

                 SALES  QUANTITYORDERED
STATUS
Cancelled     50010.65              605
Disputed      31821.90              259
In Process    35133.34              269
Resolved      53815.72              650
Shipped     1044905.31            10646

### Question 8 (1 points)
Q8. Suppose that the ordered quantity is doubled for all the records. Use the QUANTITYORDERED column and double the amounts in the sales data. Assign it to sales_orders_doubled and show the first 3 rows.

In [112]:
sales_orders_doubled = sales['QUANTITYORDERED']*2
print(sales_orders_doubled[0:3])

0    60
1    68
2    82
Name: QUANTITYORDERED, dtype: int64

### Question 9 (2 points)

Q9. Double the QUANTITYORDERED for all records, if its values is greater than 30. Do not modify the dataframe.

In [121]:
double = []
for value in sales['QUANTITYORDERED']:
    if value > 30:
        double.append(value*2)
    else:
        double.append(value)

double = pd.Series(double)
print(double)

0       30
1       68
2       82
3       90
4       98
        ..
2818    20
2819    29
2820    86
2821    68
2822    94
Length: 2823, dtype: int64

### Question 10 (2 points)

Q10. Make a MultiIndex (hierarchical indexing) dataframe using YEAR_ID and PRODUCTLINE as the two indexing levels. Year is the outer level index. Name this dataframe as sales_hdf.

In [126]:
sales['PRODUCTLINE'].value_counts()

PRODUCTLINE
Classic Cars        967
Vintage Cars        607
Motorcycles         331
Planes              306
Trucks and Buses    301
Ships               234
Trains               77
Name: count, dtype: int64

In [133]:
idx = pd.MultiIndex(levels = [['YEAR_ID', 'PRODUCTLINE']], codes = [[2003, 2004, 2005],['Classic Cars','Vintage Cars','Motorcycles',
                                                                                                  'Planes','Trucks and Buses', 'Ships','Trains']])

sales_hdf = pd.DateFrame(data, index=idx)

ValueError: Length of levels and codes must be the same.

### Question 11 (1 points)

Q11. What is the sum of the ORDERLINENUMBER for each PRODUCTLINE in each year?

In [135]:
sales.groupby(['YEAR_ID', 'PRODUCTLINE'])['ORDERLINENUMBER'].sum()

YEAR_ID  PRODUCTLINE
2003     Classic Cars        2497
         Motorcycles          772
         Planes               548
         Ships                570
         Trains               190
         Trucks and Buses     737
         Vintage Cars        1395
2004     Classic Cars        2819
         Motorcycles          890
         Planes              1184
         Ships                787
         Trains               270
         Trucks and Buses     844
         Vintage Cars        1896
2005     Classic Cars         917
         Motorcycles          301
         Planes               478
         Ships                234
         Trains                90
         Trucks and Buses     292
         Vintage Cars         543
Name: ORDERLINENUMBER, dtype: int64

### Question 12 (2.5 points)
Q12. Suppose that we have a DataFrame that contains two columns: group IDs, 'ID', and values as 'valuess'. Replace any negative values in 'valuess' with the group mean. Modify the dataframe.

group_id = [1,2,3,4,2,1,1,2,2,3,4,4,2,3,1,4]

values = [1,2,-3,-2,-7,6,-8,5,9,12,11,-1,6,8,9,0]

q12_df = pd.DataFrame( {'ID' : group_id, 'values': values})

In [196]:
group_id = [1,2,3,4,2,1,1,2,2,3,4,4,2,3,1,4]

values = [1,2,-3,-2,-7,6,-8,5,9,12,11,-1,6,8,9,0]

q12_df = pd.DataFrame( {'ID' : group_id, 'values': values})

means = q12_df.groupby('ID').mean().values

q12_df.replace(q12_df.query('ID == 1 and values < 0')['values'], means[0][0], inplace=True)
q12_df.replace(q12_df.query('ID == 2 and values < 0')['values'], means[1][0], inplace=True)
q12_df.replace(q12_df.query('ID == 3 and values < 0')['values'], means[2][0], inplace=True)
q12_df.replace(q12_df.query('ID == 4 and values < 0')['values'], means[3][0], inplace=True)

### Question 13 (2 points)
Q13. Create a DateTimeIndex consisting of the second Friday in each month for the years 2018 and 2019. Call it q17_df.

DatetimeIndex(['2015-01-09', '2015-02-13', '2015-03-13', '2015-04-10',
               '2015-05-08', '2015-06-12', '2015-07-10', '2015-08-14',
               '2015-09-11', '2015-10-09', '2015-11-13', '2015-12-11',
               '2016-01-08', '2016-02-12', '2016-03-11', '2016-04-08',
               '2016-05-13', '2016-06-10', '2016-07-08', '2016-08-12',
               '2016-09-09', '2016-10-14', '2016-11-11', '2016-12-09'],
              dtype='datetime64[ns]', freq='WOM-2FRI')

### Question 14 (2 points)
Q14. Slice the Series s; slice up to label 'B' for the first level and from label 5 onwards for the second level. It should include data from 'A' and 'B' index and index 5 to 9 (inclusive).

In [180]:
letters = ['A', 'B', 'C']
numbers = list(range(10))

mi = pd.MultiIndex.from_product([letters, numbers])
s = pd.Series(np.random.rand(30), index=mi)

s

A  0    0.852636
   1    0.291975
   2    0.257290
   3    0.567549
   4    0.710103
   5    0.378544
   6    0.536839
   7    0.363999
   8    0.630400
   9    0.184784
B  0    0.338120
   1    0.230423
   2    0.301794
   3    0.305725
   4    0.997096
   5    0.579600
   6    0.057559
   7    0.801852
   8    0.021397
   9    0.811478
C  0    0.485714
   1    0.361833
   2    0.133366
   3    0.878530
   4    0.300470
   5    0.736730
   6    0.092022
   7    0.247078
   8    0.987490
   9    0.664564
dtype: float64

In [194]:
s[['A','B']]

A  0    0.852636
   1    0.291975
   2    0.257290
   3    0.567549
   4    0.710103
   5    0.378544
   6    0.536839
   7    0.363999
   8    0.630400
   9    0.184784
B  0    0.338120
   1    0.230423
   2    0.301794
   3    0.305725
   4    0.997096
   5    0.579600
   6    0.057559
   7    0.801852
   8    0.021397
   9    0.811478
dtype: float64